{"pages":[],"posts":[{"title":"20190122tofelwriting","text":"20190122Do you agree or disagree with the following statement?People should buy things made in their own country, even if the price is higher than the same things made elsewhere.OPENINGINTRO​ The global market is a coherent whole and no country can remain out of such a trend.Meanwhile people have given greater emphasis to trade friction and growing protectionist risks . Some people claim that consumers should purchase commodities only made in their own countries to protect the national economy. THESIS​ However, taking into account the long-term benefits of a market economy, I believe that people should enjoy the freedom to choose their favorite products, regardless of where they were made. BODYTopic​ First ,imposing restrictions on imported products will weaken the competitive power of domestic manufacturers State​ According to the principles of economics, the existence of outside competitors is a powerful stimulus for local enterprise to keep improving the overall quality of products E.g.​ For example ,before China’s reform and opening-up,seldom could a Chinese automobile manufacturer get competitive strength in the world, which compelled national customers to buy low-quality vehicles at high price.However ,after implementation of the market economy,joint ventures were established, which have been motivating Chinese companies to provide better products reaching the highest quality standards.Thus BYD Motors ,a native electric vehicle manufacturer in China,has even exported school buses to the U.S constantly close​ Experience has proved that imports can offer an incentive for the national industry to keep up with the pace of the global economy ​","link":"/2019/01/22/20190122tofelwriting/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2019/01/19/hello-world/"},{"title":"Start","text":"","link":"/2019/01/19/Start/"},{"title":"TOEFL？","text":"211wewewewlje","link":"/2019/01/19/TOEFL？/"}],"tags":[],"categories":[]}